#pragma once
char LEXERROR[] = "Лексический анализ завершен с ошибками.";				// Сообщения, выводимые в консоль при сборке проекта
char SYNTERROR[] = "Синтаксический анализ завершен с ошибками.";
char SEMERROR[] = "Обнаружены семантические ошибки.";
char POLISHERROR[] = "Ошибка при попытке преобразования выражения.";
char LEXGOOD[] = "Лексический анализ:     Завершен успешно.";
char SYNTGOOD[] = "Синтаксический анализ:  Завершен успешно.";
char SEMGOOD[] = "Семантический анализ:   Завершен успешно.";
char POLISHGOOD[] = "Польская запись:        Завершен успешно.";
char MESSAGE[] = "\n------------------  КОНЕЧНЫЕ ТАБЛИЦЫ ЛЕКСЕМ И ИДЕНТИФИКАТОРОВ  ----------------";
char STOP[] = "\nВыполнение программы остановлено.";
char ALLGOOD[] = "Программа успешно завершена!";